"SPC Password" = "Parolă SPC";
"Authentication Key" = "Cheie autentificare";
"Incorrect key" = "Cheie incorectă";
"Incorrect SPC Password" = "Parolă SPC incorectă";
"Enter 26 digit key" = "Introduceți cheia de autentificare de 26 de cifre.";
"Security" = "Securitate";
"Too many retries of SPC." = "Prea multe reîncercări pentru SPC.";
"AKEY set successfully." = "Configurare AKEY reușită.";
"Failed to set AKEY." = "Configurare AKEY eșuată.";
"Too many retries of AKEY." = "Prea multe reîncercări pentru AKEY.";
"Password" = "Parolă";
"Key" = "Cheie";
"OK" = "OK";
"Cancel" = "Anulați";